In [39]:
import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from tqdm.notebook import tqdm_notebook
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['df_2000_2001.csv.gz',
 'df_2000_2001_budget_revenue_title_cert.csv.gz',
 'df_2002-2014_no_2007.csv.gz',
 'df_clean_basics.csv.gz',
 'final_basics_df.csv.gz',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'final_tmdb_data_2002.csv.gz',
 'final_tmdb_data_2003.csv.gz',
 'final_tmdb_data_2004.csv.gz',
 'final_tmdb_data_2005.csv.gz',
 'final_tmdb_data_2006.csv.gz',
 'final_tmdb_data_2008.csv.gz',
 'final_tmdb_data_2009.csv.gz',
 'final_tmdb_data_2010.csv.gz',
 'final_tmdb_data_2011.csv.gz',
 'final_tmdb_data_2012.csv.gz',
 'final_tmdb_data_2013.csv.gz',
 'final_tmdb_data_2014.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_api_results_2002.json',
 'tmdb_api_results_2003.json',
 'tmdb_api_results_2004.json',
 'tmdb_api_results_2005.json',
 'tmdb_api_results_2006.json',
 'tmdb_api_results_2007.json',
 'tmdb_api_results_2008.json',
 'tmdb_api_results_2009.json',
 'tmdb_api_results_2010.json',
 'tmdb_api_results_2011.json',
 'tmdb_api_results_2012.json',
 'tmdb_api_results_2013.json',
 'tmdb_api_results_2014.json',
 'tmdb_api_results_2015.json',
 'tmdb_api_results_2016.json',
 'tmdb_api_results_2017.json',
 'tmdb_results_combined.csv.gz']

In [40]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection)

In [41]:
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

The database already exists.

In [42]:
basics = pd.read_csv('Data/title_basics.csv.gz', low_memory=False)
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
136203,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
136204,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
136205,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
136206,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
136207,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama

In [43]:
basics = basics.replace({'\\N':np.nan})
basics.dropna(subset=['genres'], inplace=True)

In [44]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
136203,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
136204,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
136205,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,[Thriller]
136206,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"
136207,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,[Drama]

In [45]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
136204,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
136205,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
136206,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
136206,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
136207,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [46]:
unique_genres = basics['genres_split'].explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'War', 'Horror', 'Sci-Fi',
       'Mystery', 'Adventure', 'Musical', 'Action', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'Biography', 'Sport',
       'Western', 'Adult', 'Short', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [47]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [48]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [49]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [50]:
## make new integer genre_id and drop string genres
basics['genre_id'] = basics['genres_split'].replace(genre_map)
basics = basics.drop(columns='genres_split')

In [51]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [52]:
genre_lookup.to_sql('genres', engine, if_exists='replace',index=False)

26

In [53]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [54]:
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [55]:
title_genres = pd.DataFrame({'tconst': basics['tconst'], 'Genre_ID': genre_lookup['Genre_ID']}) # had the wrong df here? 
title_genres.head()

      tconst  Genre_ID
0  tt0035423       0.0
1  tt0062336       1.0
2  tt0069049       2.0
3  tt0079644       3.0
4  tt0088751       4.0

In [56]:
title_genres.dtypes

tconst       object
Genre_ID    float64
dtype: object

In [57]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()

In [58]:
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "Genre_ID": Integer()}

In [59]:
title_genres

           tconst  Genre_ID
0       tt0035423       0.0
1       tt0062336       1.0
2       tt0069049       2.0
3       tt0079644       3.0
4       tt0088751       4.0
...           ...       ...
136203  tt9916170       NaN
136204  tt9916190       NaN
136205  tt9916270       NaN
136206  tt9916362       NaN
136207  tt9916538       NaN

[136208 rows x 2 columns]

In [60]:
title_genres.to_sql('title_genres', engine, index=False, if_exists='replace', dtype=df_schema)

136208

In [91]:
engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')

In [61]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  Genre_ID
0  tt0035423         0
1  tt0062336         1
2  tt0069049         2
3  tt0079644         3
4  tt0088751         4

In [62]:
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear           int64
endYear           float64
runtimeMinutes      int64
genres             object
genre_id           object
dtype: object

In [63]:
basics = basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'genres', 'genre_id'])

In [64]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [65]:
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [66]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

136208

In [67]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [83]:
title_basics = basics

In [68]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0079644,November 1828,2001.0,None,140
4,tt0088751,The Naked Monster,2005.0,None,100

In [69]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz', low_memory=False)
title_ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1909
1        tt0000002            5.8       256
2        tt0000003            6.5      1710
3        tt0000004            5.6       169
4        tt0000005            6.2      2525
...            ...            ...       ...
1258871  tt9916690            6.5         6
1258872  tt9916720            5.1       252
1258873  tt9916730            8.4         6
1258874  tt9916766            6.8        21
1258875  tt9916778            7.2        35

[1258876 rows x 3 columns]

In [70]:
title_ratings.to_sql('title_ratings', engine, if_exists='replace',index=False)

1258876

In [71]:
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1909
1  tt0000002            5.8       256
2  tt0000003            6.5      1710
3  tt0000004            5.6       169
4  tt0000005            6.2      2525

In [72]:
tmdb = pd.read_csv('Data/df_2000_2001.csv.gz', low_memory=False)
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0116748,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.5,2.0,NaN

In [73]:
tmdb.drop(columns='adult',inplace=True)
tmdb.drop(columns='backdrop_path', inplace=True)
tmdb.drop(columns='belongs_to_collection', inplace=True)
tmdb.drop(columns='genres', inplace=True)
tmdb.drop(columns='homepage', inplace=True)
tmdb.drop(columns='id', inplace=True)
tmdb.drop(columns='original_language', inplace=True)
tmdb.drop(columns='overview', inplace=True)
tmdb.drop(columns='popularity', inplace=True)
tmdb.drop(columns='poster_path', inplace=True)
tmdb.drop(columns='production_companies', inplace=True)
tmdb.drop(columns='production_countries', inplace=True)
tmdb.drop(columns='release_date', inplace=True)
tmdb.drop(columns='runtime', inplace=True)
tmdb.drop(columns='spoken_languages', inplace=True)
tmdb.drop(columns='status', inplace=True)
tmdb.drop(columns='tagline', inplace=True)
tmdb.drop(columns='video', inplace=True)
tmdb.drop(columns='vote_average', inplace=True)
tmdb.drop(columns='vote_count', inplace=True)
tmdb.drop(columns='original_title', inplace=True)
tmdb.head()

     imdb_id      budget  revenue            title certification
0          0         NaN      NaN              NaN           NaN
1  tt0113026  10000000.0      0.0  The Fantasticks           NaN
2  tt0113092         0.0      0.0    For the Cause           NaN
3  tt0116391         0.0      0.0             Gang           NaN
4  tt0116748         0.0      0.0         Karobaar           NaN

In [86]:
tmdb.dropna(subset=['title'], inplace=True)
tmdb.isna().sum()

imdb_id             0
budget              0
revenue             0
title               0
certification    4229
dtype: int64

In [89]:
tmdb.to_sql('tmdb', engine, if_exists='replace',index=False)

5055

In [90]:
q = """SELECT * FROM tmdb LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue                 title certification
0  tt0113026  10000000.0         0.0       The Fantasticks          None
1  tt0113092         0.0         0.0         For the Cause          None
2  tt0116391         0.0         0.0                  Gang          None
3  tt0116748         0.0         0.0              Karobaar          None
4  tt0118694    150000.0  12854953.0  In the Mood for Love            PG

In [76]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4             tmdb

In [84]:
title_basics.to_csv("Data/final_basics_df.csv.gz",compression='gzip',index=False)

In [78]:
title_ratings.to_csv("Data/final_ratings_df.csv.gz",compression='gzip',index=False)

In [79]:
title_genres.to_csv("Data/final_genres_df.csv.gz",compression='gzip',index=False)

In [80]:
tmdb.to_csv("Data/final_tmdb_df.csv.gz",compression='gzip',index=False)